export const categories = [
  { name: 'Класична література' }, //2 книги
  { name: 'Фентезі ' }, //1 книга
  { name: 'Трилери та жахи' }, //1 книга
  { name: 'Детективи' }, //5 книги
  { name: 'Історичне та пригодницьке' }, //3 книги
  { name: 'Наук-поп'}, //2 книги [+]
  { name: 'Бізнес-література' }, //0 книг
];

export const authors = [
  {
    firstName: "Стівен",
    lastName: "Кінг",
    bio: "Стівен Кінг – один із найвідоміших сучасних письменників, якого називають 'королем жахів'. Його творчість охоплює широкий спектр жанрів – від хорору та трилерів до драм і фантастики. Романи Кінга, як-от 'Сяйво', 'Воно', 'Кладовище домашніх тварин', стали класикою світової літератури, а їхні адаптації часто з'являються на великих екранах.",
  },
  {
    firstName: "Агата",
    lastName: "Крісті",
    bio: "Аґата Крісті – неперевершена королева детективу, чиї твори стали класикою жанру і підкорили серця мільйонів читачів у всьому світі. Її романи наповнені заплутаними загадками, несподіваними поворотами та атмосферою справжнього британського шарму. Крісті створила легендарних детективів – Еркюля Пуаро та міс Марпл, які досі залишаються улюбленцями шанувальників літературних розслідувань. Кожна її книга – це інтелектуальна гра, де читач має шанс відчути себе справжнім детективом, намагаючись розгадати таємницю разом із головними героями.",
  },
  {
    firstName: "Стівен",
    lastName: "Гокінґ",
    bio: null,
  },
  {
    firstName: "Ґреґ",
    lastName: "Маккеон",
    bio: null,
  }
]

export const publishers = [
  {
    id: 1,
    name: "Kyiv Publishing",
    description: "Видавництво з Києва, що спеціалізується на художній літературі.",
    email: "contact@kyivpublishing.ua",
    phone: "+380441234567",
    country: "Україна",
    foundedAt: new Date("1990-05-10T00:00:00Z"),
  }
]

export const books = [
  //агата крісті. id 2
  {
    id: 1,
    title: 'Велика четвірка',
    authorId: 2,
    publisherId: 1,
    categoryId: 5,
    pages: 202,
    readingAge: '10+',
    dimensions: '12x18 см',
    coverUrl: 'https://ksd.ua/storage/products/gallery/medium_x2/HclG6VwvLFEQ6R3tpVej4QkdiEUnsK59uGW81kn9.png.webp?v=1750748313',
    summary: 'Капітан Гастінґс повертається до Англії і дізнається, що його давній друг, Еркюль Пуаро, опинився в самому центрі заплутаної і смертельно небезпечної міжнародної інтриги. Після раптової смерті загадкового відвідувача вони довідуються про існування Великої четвірки - потужної та безжальної організації, що маніпулює подіями на глобальному рівні.'
  },
  {
    id: 2,
    title: 'Кіт серед голубів',
    authorId: 2,
    publisherId: 1,
    categoryId: 5,
    pages: 240,
    readingAge: '10+',
    dimensions: '12x18 см',
    coverUrl: 'https://ksd.ua/storage/products/gallery/medium_x2/yZW76rJP6HI3JtDCByG4YMgpDaoCfxMxjrs3rMtt.jpg.webp?v=1747731144',
    summary: 'В елітній школі для дівчаток посеред ночі стається непередбачуване - вбито вчительку фізкультури. Її недолюблювали, але хто б наважився на постріл упритул? І головне - навіщо? Інспектор поліції береться за розслідування і робить приголомшливе відкриття: серед працівників школи затесався агент британської розвідки. Його місія - знайти коштовності, що безслідно зникли під час революції в східному королівстві.'
  },
  {
    id: 3,
    title: 'Годинники',
    authorId: 2,
    publisherId: 1,
    categoryId: 5,
    pages: 400,
    readingAge: '10+',
    dimensions: '12x18 см',
    coverUrl: 'https://ksd.ua/storage/products/gallery/medium_x2/KtOM2050G6Hz0LJD9p65nnL2NAPmTT4umz4ZeSxb.jpg.webp?v=1733319314',
    summary: 'Стенографістка Шейла Веб приходить на зустріч до поважної сліпої пані. Проте у вітальні її зустрічає не господиня - натомість вона натрапляє на мертве тіло… Ніхто не знає, ким був цей чоловік і звідки він узявся. Навіщо вбивця розклав довкола жертви кілька годинників і що означає час на них? Колін Лемб, який волею долі виявився залученим до розслідування, не знаходить відповідей. Тому звертається по допомогу до Еркюля Пуаро.'
  },

  //стівен гокінг. id 3
  {
    id: 4,
    title: 'Про Всесвіт коротко',
    authorId: 3,
    publisherId: 1,
    categoryId: 6,
    pages: 192,
    readingAge: '16+',
    dimensions: '15x22 см',
    coverUrl: 'https://ksd.ua/storage/products/gallery/expanded_x2/WSKTO9t2QIDOAEgS7iTrPKpUnbDzZIABmnqrz545.jpg.webp?v=1733321312',
    summary: 'Стівен Гокінґ - прославлений англійський учений, чи не найвідоміших популяризатор науки у світі, людина-легенда. Його вважають одним з найгеніальніших фізиків від часів Ейнштейна. Найбільшу популярність здобув завдяки дослідженню чорних дір і теорії виникнення Всесвіту в результаті Великого вибуху. Автор бестселерів "Найкоротша історія часу", "Великий задум" та "Чорні діри і молоді всесвіти", володар численних нагород та премій.'
  },

  //грег маккеон. id 4
  {
    id: 5,
    title: 'Планер есенціаліста на 90 днів',
    authorId: 4,
    publisherId: 1,
    categoryId: 6,
    pages: 224,
    readingAge: '16+',
    dimensions: '15x22 см',
    coverUrl: 'https://ksd.ua/storage/products/gallery/medium_x2/dU2dEMmiZH6i1K2ILAel0unI2OBO3rElWuQeUXcP.jpg.webp?v=1741003613',
    summary: 'Стівен Гокінґ - прославлений англійський учений, чи не найвідоміших популяризатор науки у світі, людина-легенда. Його вважають одним з найгеніальніших фізиків від часів Ейнштейна. Найбільшу популярність здобув завдяки дослідженню чорних дір і теорії виникнення Всесвіту в результаті Великого вибуху. Автор бестселерів "Найкоротша історія часу", "Великий задум" та "Чорні діри і молоді всесвіти", володар численних нагород та премій.'
  },
]

export const comments = []